In [1]:
import pandas as pd

In [21]:
# Criando um dataset qualquer a partir de um dicionário

Base = {'Papel':['LREN3', 'MDIA3', 'VLID3', 'FLRY3'],
        'Quantidade':[200, 100, 300, 400],
        'Preço de Compra':['R$ 15,00','R$ 20,00', 'R$ 17,00', 'R$ 14,00'],
        'Preço de Venda': ['R$ 20,00', '', 'R$ 23,00', '']}

Base = pd.DataFrame(Base)
Base

   Papel  Quantidade Preço de Compra Preço de Venda
0  LREN3         200        R$ 15,00       R$ 20,00
1  MDIA3         100        R$ 20,00
2  VLID3         300        R$ 17,00       R$ 23,00
3  FLRY3         400        R$ 14,00

In [22]:
# Tratando as variáveis strings que contêm valor
# Primeiro passo: remover os caracteres R$ da variável
# O 'split(' ')' transforma a string numa lista separando a partir do ' '. O [1] fica com 2° item da lista

Base['Preço de Compra'].apply(lambda x: str(x).split(' ')[1])

0    15,00
1    20,00
2    17,00
3    14,00
Name: Preço de Compra, dtype: object

In [23]:
# Um outro modo de resolver o Primeiro passo (o método não é 'inplace')
Base['Preço de Compra'].apply(lambda x: str(x).replace('R$ ',''))

0    15,00
1    20,00
2    17,00
3    14,00
Name: Preço de Compra, dtype: object

In [24]:
# Resolvendo para uma lista de variáveis
ListaVars = ['Preço de Compra', 'Preço de Venda']

for i in ListaVars:
    Base[i] = Base[i].apply(lambda x: str(x).replace('R$ ',''))
    
Base

   Papel  Quantidade Preço de Compra Preço de Venda
0  LREN3         200           15,00          20,00
1  MDIA3         100           20,00
2  VLID3         300           17,00          23,00
3  FLRY3         400           14,00

In [25]:
# Novamente, agora substituindo a ',' por '.'
ListaVars = ['Preço de Compra', 'Preço de Venda']

for i in ListaVars:
    Base[i] = Base[i].apply(lambda x: str(x).replace(',','.'))
    
Base

   Papel  Quantidade Preço de Compra Preço de Venda
0  LREN3         200           15.00          20.00
1  MDIA3         100           20.00
2  VLID3         300           17.00          23.00
3  FLRY3         400           14.00

In [30]:
# Agora, com formatação adequada, convertemos as colunas em numéricas
Base['Preço de Compra'] = Base['Preço de Compra'].astype('float64')
Base.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Papel            4 non-null      object
 1   Quantidade       4 non-null      int64
 2   Preço de Compra  4 non-null      float64
 3   Preço de Venda   4 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 256.0+ bytes

In [31]:
# A segunda coluna, como contém valores nulos, é necessário utilizar outro comando para trata-los
Base['Preço de Venda'] = pd.to_numeric(Base['Preço de Venda'], errors='coerce')
Base.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Papel            4 non-null      object
 1   Quantidade       4 non-null      int64
 2   Preço de Compra  4 non-null      float64
 3   Preço de Venda   2 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 256.0+ bytes